home/me/emacs.org
#+TITLE Emacs Configuration
#+STARTUP: overview
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el 

* NIX Configuration (for Emacs)

To tangle ~./emacs.nix~ use <kbd>C-c C-v T</kbd>.

#+begin_src nix :tangle ./emacs.nix
  { config, pkgs, ... }: {

    
    programs.emacs = {
      enable = true;
      package = pkgs.emacs;  # replace with pkgs.emacs-gtk, or a version provided by the community overlay if desired.
    	extraPackages = epkgs: [
    	  epkgs.use-package
    	  epkgs.cask
    	  epkgs.counsel-projectile
        epkgs.doom-modeline
        epkgs.doom-themes
    	  epkgs.nix-mode
        epkgs.forge
        epkgs.fsharp-mode
        epkgs.general
        epkgs.helpful
        epkgs.hydra
        epkgs.evil # Vim keybindings
        epkgs.evil-collection
        epkgs.evil-nerd-commenter

        epkgs.all-the-icons-dired
        epkgs.dired-open
        epkgs.dired-hide-dotfiles
        
        # epkgs.evil-magit
        epkgs.lsp-mode
        epkgs.lsp-ui
        epkgs.lsp-treemacs
        epkgs.lsp-ivy
        epkgs.magit # Git integration
        epkgs.org-bullets
        # epkgs.org-habit
        epkgs.which-key # Keybinding suggestions
        epkgs.ivy # Fuzzy completion
        epkgs.ivy-rich
        epkgs.counsel # Ivy-based commands
        epkgs.swiper # Fuzzy search
        epkgs.typescript-mode
        epkgs.company # Auto-completion
        epkgs.company-box
        epkgs.projectile # Project management
        epkgs.rainbow-delimiters # Colorful brackets
        epkgs.visual-fill-column
        # shells
        epkgs.vterm
        epkgs.eshell-z
        epkgs.eshell-git-prompt
      ];
    };
    
    home.file.".emacs.d/.keep".text = "";
    home.file.".emacs.d/init.el".source = ./init.el;
  }
#+end_src

* Startup
#+begin_src emacs-lisp 
  (setq inhibit-startup-message t)

  ;; Set a dark theme quickly, becase the doom theme sometimes takes a while to laod
  ;; this prevents a prolonged white screen when starting
  (load-theme 'tango-dark t)
#+end_src

* Basic UI Config
** Remove standard emacs UI elements
#+begin_src emacs-lisp
  (scroll-bar-mode -1)        ; Disable visible scrollbar
  (tool-bar-mode -1)          ; Disable the toolbar
  (tooltip-mode -1)           ; Disable tooltips
  (set-fringe-mode 10)        ; Give some breathing room
  (menu-bar-mode -1)          ; Disable the menu bar
#+end_src

** Visual Bell
#+begin_src emacs-lisp
  (setq visible-bell t)
#+end_src

* Key bindings
** Use escape to quit any propts
#+begin_src emacs-lisp
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+end_src

** EVIL Mode
#+begin_src emacs-lisp
  (use-package evil
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump nil)
    :config
    (evil-mode 1)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)
    
    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))

  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))
#+end_src
** General (used for space leader key)
#+begin_src emacs-lisp
  (use-package general
    :config
    (general-create-definer my/leader-keys
      :keymaps '(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "C-SPC")

    (my/leader-keys
      "b"  '(:ignore t :which-key "buffers")
      "bk" '((lambda () (interactive) (kill-buffer (current-buffer)))  :which-key "kill buffer")
      "bs" '(counsel-switch-buffer :which-key "switch buffer")
      
      "t"  '(:ignore t :which-key "toggles")
      "tt" '(counsel-load-theme :which-key "choose theme")))
#+end_src

** Org Mode keys

#+begin_src emacs-lisp
  (my/leader-keys
    "o"    '(:ignore t :which-key "org")
    "oa"   '(org-agenda :which-key "agenda")
    "oc"   '(org-capture :which-key "capture")
    "or"   '(org-refile :which-key "refile")
    "ot"   '(counsel-org-tags :which-key "tags")
    ;; org dates
    "od"   '(:prefix t :which-key "date")
    "od."  '(org-timestamp :which-key "timestamp")
    "od!"  '(org-timestamp-inactive :which-key "inactive")
    "ods"  '(org-schedule :which-key "schedule")
    "odd"  '(org-deadline :which-key "deadline"))
#+end_src


** Other general key maps
#+begin_src emacs-lisp
  (my/leader-keys
    "f"  '(:ignore t :which-key "files")	
    "."  '(counsel-find-file :which-key "find file")
    "fr" '(counsel-recentf :which-key "files")
    "fd" '(dired :which-key "dired")
    )
#+end_src

* UI
** Zone Mode

#+begin_src emacs-lisp
  (require 'zone)
  (zone-when-idle 60)
#+end_src

** Fonts
#+begin_src emacs-lisp
  (set-face-attribute 'default nil :font "Fira Code" :height 120)
  (set-face-attribute 'fixed-pitch nil :font "Fira Code" :height 100)
  (set-face-attribute 'variable-pitch nil :font "Noto Serif" :height 110 :weight 'regular )
#+end_src

** Themes
#+begin_src emacs-lisp
  (use-package doom-themes)
  (load-theme 'doom-acario-dark t)
#+end_src

** Mode Line
#+begin_src emacs-lisp
  (use-package doom-modeline
    :init (doom-modeline-mode 1)
    :custom ((doom-modeline-height 30)))

  ;; Display column number of mode line
  (set-face-attribute 'mode-line nil :height 120)
  (column-number-mode)
#+end_src

** Line numbers
#+begin_src emacs-lisp
  (global-display-line-numbers-mode t)

  ;; Disable line numbers for some modes
  (dolist (mode '(org-mode-hook
  		tetris-mode
                  term-mode-hook
  		shell-mode-hook
  		treemacs-mode-hook
  		vterm-mode-hook
  		eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

** Visual Fill Column
#+begin_src emacs-lisp
  (with-eval-after-load 'visual-fill-column
     (setq visual-fill-column-width 120) ; Set the width of the text column
     (setq visual-fill-column-center-text t) ; Center the text
     (global-visual-fill-column-mode 1)) ; Enable globally

  (defun my/tetris-mode-visual-fill ()
      (setq visual-fill-column-width 40
            visual-fill-column-center-text t)
      (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook (tetris-mode . my/tetris-mode-visual-fill))
  
  (defun my/snake-mode-visual-fill ()
      (setq visual-fill-column-width 80
            visual-fill-column-center-text t)
      (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook (snake-mode . my/tetris-mode-visual-fill))

#+end_src

** Text Scaling, with Hydra
#+begin_src emacs-lisp
   (use-package hydra)

   (defhydra hydra-text-scale (:timeout 4)
     "scale text"
     ("j" text-scale-increase "in")
     ("k" text-scale-decrease "out")
     ("f" nil "finished" :exit t))

   (my/leader-keys
     "ts" '(hydra-text-scale/body :which-key "scale text"))
#+end_src
* Minibuffer stuff
** Enable which-key for keybinding suggestions
#+begin_src emacs-lisp
  (require 'which-key)
  (which-key-mode)
#+end_src
** Ivy & councel
*** Ivy with a few EVIL style keys

#+begin_src emacs-lisp
      (use-package ivy
        :diminish
        :bind (("C-s" . swiper)
               :map ivy-minibuffer-map
               ("TAB" . ivy-alt-done)	
               ("C-l" . ivy-alt-done)
               ("C-j" . ivy-next-line)
               ("C-k" . ivy-previous-line)
               :map ivy-switch-buffer-map
               ("C-k" . ivy-previous-line)
               ("C-l" . ivy-done)
               ("C-d" . ivy-switch-buffer-kill)
               :map ivy-reverse-i-search-map
               ("C-k" . ivy-previous-line)
               ("C-d" . ivy-reverse-i-search-kill))
        :config
        (ivy-mode 1))

   (advice-add 'org-set-tags-command :override 'counsel-org-tag) 
#+end_src

*** Ivy Rich
#+begin_src emacs-lisp
  (use-package ivy-rich :init (ivy-rich-mode 1))
#+end_src

*** Councel
#+begin_src emacs-lisp
   (use-package counsel
     :bind (("M-x" . counsel-M-x)
            ("C-x b" . counsel-ibuffer)
            ("C-x C-f" . counsel-find-file)
            :map minibuffer-local-map
            ("C-r" . 'counsel-minibuffer-history)))
#+end_src

** Helpful Help, with Helpful                                           
#+begin_src emacs-lisp
  (use-package helpful
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap org-set-tags-command] . councel-org-tag)
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))
#+End_src

* Programming
** Code completion with Company
#+begin_src emacs-lisp
(use-package company
  :after lsp-mode
  :hook (lsp-mode . company-mode)
  :bind (:map company-active-map
         ("<tab>" . company-complete-selection))
        (:map lsp-mode-map
         ("<tab>" . company-indent-or-complete-common))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0))

(use-package company-box
  :hook (company-mode . company-box-mode))

 (add-hook 'after-init-hook 'global-company-mode)
#+end_src

** Rainbow Brackets
#+begin_src emacs-lisp
   (use-package rainbow-delimiters
     :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

** Commenting
#+begin_src emacs-lisp
(use-package evil-nerd-commenter
  :bind ("M-/" . evilnc-comment-or-uncomment-lines))
#+end_src
** Git, with Magit (and Forge)
#+begin_quote
NOTE: Make sure to configure a GitHub token before using this package!
- https://magit.vc/manual/forge/Token-Creation.html#Token-Creation
- https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started
#+end_quote

#+begin_src emacs-lisp
  (use-package magit
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

  
  (use-package forge)
#+end_src

** Languages
