home/me/init.el

(defun efs/lsp-mode-setup ()
  (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
  (lsp-headerline-breadcrumb-mode))

(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :hook (lsp-mode . efs/lsp-mode-setup)
  :init
  (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
  :config
  (lsp-enable-which-key-integration t))

(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :custom
  (lsp-ui-doc-position 'bottom))

(use-package lsp-treemacs
  :after lsp)

(use-package lsp-ivy)

(my/leader-keys
   "l"   '(:ignore t :which-key "lsp mode")
   "ld"  '(flymake-show-project-diagnostics :which-key "diagnostics")
   "lt"  '(:prefix t :which-key "tree")
   "lts" '(lsp-treemacs-symbols :which-key "symbols")
   "ls"  '(lsp-ivy-workspace-symbol :which-key "find symbol")
   )

(use-package fsharp-mode
  :mode " \\.fs[iylx]?$'"
  :hook (fsharp-mode . lsp-deferred)
  :config
  (autoload 'fsharp-mode "fsharp" "Major mode for editing F# code." t)
  (autoload 'run-fsharp "inf-fsharp" "Run an inferior F# process." t)
  (autoload 'mdbg "mdbg" "The CLR debugger" t)
  ;; (setq inferior-fsharp-program "PATH_TO_YOUR_FSI_EXE")
  ;; (setq fsharp-compiler "PATH_TO_YOUR_FSC_EXE")
  (add-to-list 'auto-mode-alist '("\\.fs[iylx]?$" . fsharp-mode))
        )



(use-package typescript-mode
  :mode "\\.ts\\'"
  :hook (typescript-mode . lsp-deferred)
  :config
  (setq typescript-indent-level 2))

(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  ;; NOTE: Set this to the folder where you keep your Git repos!
  (when (file-directory-p "~/Projects/Code")
    (setq projectile-project-search-path '("~/Projects/Code")))
  (setq projectile-switch-project-action #'projectile-dired))

(use-package counsel-projectile
  :config (counsel-projectile-mode))

(defun my/org-mode-setup ()
  (org-indent-mode)
  (variable-pitch-mode 1)
  (visual-line-mode 1)

  (setq org-agenda-start-with-log-mode t)
  (setq org-log-done 'time)
  (setq org-log-into-drawer t)
  )

(defun my/org-font-setup ()
  ;; Replace list hyphen with dot
  (font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

  ;; Set faces for heading levels
  (dolist (face '((org-level-1 . 1.4)
                  (org-level-2 . 1.2)
                  (org-level-3 . 1.1)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.1)
                  (org-level-7 . 1.1)
                  (org-level-8 . 1.1)))
    (set-face-attribute (car face) nil :font "noto sans" :weight 'regular :height (cdr face)))

  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))

(use-package org-bullets
     :after org
     :hook (org-mode . org-bullets-mode)
     :custom
     (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

(defun my/org-mode-visual-fill ()
    (setq visual-fill-column-width 120
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook (org-mode . my/org-mode-visual-fill))

(setq org-directory "~/OneDrive/org/")
(setq org-agenda-files '("~/OneDrive/org/tasks.org"
                         "~/OneDrive/org/anniversaries.org"))

(setq org-capture-templates
       '(
         ;; ("j" "Journal")
         ;; ("jj" "journal" entry (file+datetree "~/OneDrive/org/journal.org")
         ;;  "\n\n* %U\n%?")
         ;; ("jt" "journal" entry (file+datetree "~/OneDrive/org/journal.org")
         ;;  "* [ ] %?\nSCHEDULED: %t")

         ("j" "Journal")
         ("jj" "Journal" entry
          (file+olp+datetree "journal.org" "Journal")
          "* Entry - %<%H:%M>\n%U\n\n%?"
          :empty-lines 1
 	 :kill-buffer t)
         ("jg" "Goals" entry
          (file+olp+datetree "journal.org" "Journal")
          "* TODO Goals - %<%d %B %Y> [/]\nSCHEDULED: %t\n** [ ] %?"
          :prepend t)

         ("b" "blog-post" entry (file+olp "~/repos/blog-home/blog.org" "blog")
          "* TODO %^{Title} %^g \n:PROPERTIES:\n:EXPORT_FILE_NAME: %^{Slug}\n:EXPORT_DATE: %T\n:END:\n\n%?"
          :empty-lines-before 2)

         ("m" "Email Workflow")
         ("mf" "Follow Up" entry (file+olp "~/OneDrive/org/mail.org" "Follow Up")
          "* TODO Follow up with %:fromname on %a\nSCHEDULED:%t\n\n%i")
         ("mr" "Read Later" entry (file+olp "~/OneDrive/org/mail.org" "Read Later")
          "* TODO Read %a\nSCHEDULED:%t\n\n%i")

       ("s" "Sleep Entry" table-line
          (file+headline "sleep.org" "Data")
          "|#|%^{Date}u|%^{Move (kcal)}|%^{Exercise (min)}|%^{Caffeine (mg)}|%^{Tim in daylight (min)}|%^{Time in bed}|%^{Time out of bed}|%^{Sleep Duration (h:mm)}||%^{Tags}g|"
          :immediate-finish t :jump-to-captured t
          )

         ("t" "Task" entry
          (file+headline "tasks.org" "Tasks")
          "** TODO %? %^g\n:PROPERTIES:\n:CREATED: %U\n:END:\n" :empty-lines 1)

         ("T" "Task with Deadline" entry
          (file+headline "tasks.org" "Tasks")
          "** TODO %?  %^g\nDEADLINE: %^t\n:PROPERTIES:\n:CREATED: %U\n:END:\n" :empty-lines 1)

         ))

(require 'org-tempo)
   (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
   (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
   (add-to-list 'org-structure-template-alist '("py" . "src python"))

(setq org-todo-keywords
          '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
            (sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVE(a)" "REVIEW(v)" "WAIT(w@/!)" "HOLD(h)"
			"|" "COMPLETED(c)" "CANC(k@)")))

(require 'org-habit)
 (add-to-list 'org-modules 'org-habit)
 (setq org-habit-graph-column 60)
