home/me/emacs.org
** Agenda (Custome views)
#+begin_src emacs-lisp
  (setq org-agenda-custom-commands
   '(("d" "Dashboard"
     ((agenda "" ((org-deadline-warning-days 7)))
      (todo "NEXT"
        ((org-agenda-overriding-header "Next Tasks")))
      (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))

    ("n" "Next Tasks"
     ((todo "NEXT"
        ((org-agenda-overriding-header "Next Tasks")))))

    ("W" "Work Tasks" tags-todo "+work-hold")

    ;; Low-effort next actions
    ("e" tags-todo "+TODO=\"NEXT\"+Effort<15&+Effort>0"
     ((org-agenda-overriding-header "Low Effort Tasks")
      (org-agenda-max-todos 20)
      (org-agenda-files org-agenda-files)))

    ("w" "Workflow Status"
     ((todo "WAIT"
            ((org-agenda-overriding-header "Waiting on External")
             (org-agenda-files org-agenda-files)))
      (todo "REVIEW"
            ((org-agenda-overriding-header "In Review")
             (org-agenda-files org-agenda-files)))
      (todo "PLAN"
            ((org-agenda-overriding-header "In Planning")
             (org-agenda-todo-list-sublevels nil)
             (org-agenda-files org-agenda-files)))
      (todo "BACKLOG"
            ((org-agenda-overriding-header "Project Backlog")
             (org-agenda-todo-list-sublevels nil)
             (org-agenda-files org-agenda-files)))
      (todo "READY"
            ((org-agenda-overriding-header "Ready for Work")
             (org-agenda-files org-agenda-files)))
      (todo "ACTIVE"
            ((org-agenda-overriding-header "Active Projects")
             (org-agenda-files org-agenda-files)))
      (todo "COMPLETED"
            ((org-agenda-overriding-header "Completed Projects")
             (org-agenda-files org-agenda-files)))
      (todo "CANC"
            ((org-agenda-overriding-header "Cancelled Projects")
             (org-agenda-files org-agenda-files)))))))
#+end_src
** Refile (archive TODOs)
#+begin_src emacs-lisp
  (setq org-refile-targets
    '(("archive.org" :maxlevel . 2)
      ("tasks.org" :maxlevel . 1)))
  ;; Save Org buffers after refiling!
  (advice-add 'org-refile :after 'org-save-all-org-buffers)
#+end_src

** Initialise org mode
#+begin_src emacs-lisp
   (use-package org
     :hook (org-mode . my/org-mode-setup)
     :config
     (setq org-ellipsis " ▾")
     (my/org-font-setup))
#+end_src
* Org Babel, and tangle
#+begin_src emacs-lisp
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (python . t)))

  (push '("conf-unix" . conf-unix) org-src-lang-modes)

  ;; Automatically tangle our Emacs.org config file when we save it
  (defun efs/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
                        (expand-file-name "~/nixos-config/home/me/emacs.org"))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'efs/org-babel-tangle-config)))
#+end_src
* Dired

- Ret :: open file
- S-Ret :: open file new window
- M-Rert :: open file new window, keep focus
  
** Key Bindings
*** Navigation

*** macs / Evil

    n / j - next line
    p / k - previous line
    j / J - jump to file in buffer
    RET - select file or directory
    ^ - go to parent directory
    S-RET / g O - Open file in “other” window
    M-RET - Show file in other window without focusing (previewing files)
    g o (dired-view-file) - Open file but in a “preview” mode, close with q
    g / g r Refresh the buffer with revert-buffer after changing configuration (and after filesystem changes!)

*** Marking files

    m - Marks a file
    u - Unmarks a file
    U - Unmarks all files in buffer
    * t / t - Inverts marked files in buffer
    % m - Mark files in buffer using regular expression
    * - Lots of other auto-marking functions
    k / K - “Kill” marked items (refresh buffer with g / g r to get them back)
    Many operations can be done on a single file if there are no active marks!

*** Copying and Renaming files

    C - Copy marked files (or if no files are marked, the current file)
    Copying single and multiple files
    U - Unmark all files in buffer
    R - Rename marked files, renaming multiple is a move!
    % R - Rename based on regular expression: ^test , old-\&

Power command: C-x C-q (dired-toggle-read-only) - Makes all file names in the buffer editable directly to rename them! Press Z Z to confirm renaming or Z Q to abort.
Deleting files

    D - Delete marked file
    d - Mark file for deletion
    x - Execute deletion for marks
    delete-by-moving-to-trash - Move to trash instead of deleting permanently
 
*** Creating and extracting archives

    Z - Compress or uncompress a file or folder to (.tar.gz)
    c - Compress selection to a specific file
    dired-compress-files-alist - Bind compression commands to file extension

*** Other common operations

    T - Touch (change timestamp)
    M - Change file mode
    O - Change file owner
    G - Change file group
    S - Create a symbolic link to this file
    L - Load an Emacs Lisp file into Emacs



  #+begin_src emacs-lisp
    (use-package dired
      :ensure nil
      :commands (dired dired-jump)
      :bind (("C-x C-j" . dired-jump))
      :custom ((dired-listing-switches "-agho --group-directories-first"))
      :config
      (evil-collection-define-key 'normal 'dired-mode-map
        "h" 'dired-single-up-directory
        "l" 'dired-single-buffer))

    (use-package all-the-icons-dired
      :hook (dired-mode . all-the-icons-dired-mode))

    (use-package dired-open
      :config
      ;; Doesn't work as expected!
      ;;(add-to-list 'dired-open-functions #'dired-open-xdg t)
      (setq dired-open-extensions '(("png" . "feh")
                                    ("mkv" . "mpv"))))

    (use-package dired-hide-dotfiles
      :hook (dired-mode . dired-hide-dotfiles-mode)
      :config
      (evil-collection-define-key 'normal 'dired-mode-map
        "H" 'dired-hide-dotfiles-mode))
  #+end_src

* Terminals

** term-mode
#+begin_src emacs-lisp
    (use-package term
      :config
      (setq explicit-shell-file-name "zsh") ;; Change this to zsh, etc
      ;;(setq explicit-zsh-args '())         ;; Use 'explicit-<shell>-args for shell-specific args

      ;; Match the default Bash shell prompt.  Update this if you have a custom prompt
      (setq term-prompt-regexp "^.*?\ \ *")
      )
#+end_src

*** Better term mode colours
#+begin_src emacs-lisp :tangle no
;(use-package eterm-256color
;  :hook (term-mode . eterm-256color-mode))
#+end_src

** vterm

#+begin_src emacs-lisp
  (use-package vterm
    :commands vterm
    :config
    (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *")  ;; Set this to match your custom shell prompt
    ;;(setq vterm-shell "zsh")                       ;; Set this to customize the shell to launch
    (setq vterm-max-scrollback 10000))
#+end_src

** shell-mode

#+begin_src emacs-lisp
(when (eq system-type 'windows-nt)
  (setq explicit-shell-file-name "powershell.exe")
  (setq explicit-powershell.exe-args '()))
#+end_src

** Eshell

#+begin_src emacs-lisp
  (defun eshell-load-zsh-aliases ()
    "Read zsh aliases and add them to the list of eshell aliases."
    ;; Bash needs to be run - temporarily - interactively
    ;; in order to get the list of aliases.
      (with-temp-buffer
        (call-process "zsh" nil '(t nil) nil "-ci" "alias")
        (goto-char (point-min))
        (while (re-search-forward "alias \\(.+\\)='\\(.+\\)'$" nil t)
          (eshell/alias (match-string 1) (match-string 2)))))

  (defun efs/configure-eshell ()
    ;; Save command history when commands are entered
    (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)
    
    ;; Truncate buffer for performance
    (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)
    
    ;; Bind some useful keys for evil-mode

    (evil-define-key '(normal insert visual) eshell-mode-map (kbd "<home>") 'eshell-bol)
    (evil-normalize-keymaps)
    
    (setq eshell-history-size         10000
          eshell-buffer-maximum-lines 10000
          eshell-hist-ignoredups t
          eshell-scroll-to-bottom-on-input t))

  (use-package eshell-git-prompt)

  (use-package eshell
    :hook (eshell-first-time-mode . efs/configure-eshell)
    :config
    
    (with-eval-after-load 'esh-opt
      (setq eshell-destroy-buffer-when-process-dies t)
      (setq eshell-visual-commands '("htop" "btop" "nvtop" "zsh" "vim")))
    
    (add-hook 'eshell-alias-load-hook 'eshell-load-zsh-aliases)
    (eshell-git-prompt-use-theme 'powerline))
#+end_src

* NIX Configuration (in Emacs)
#+begin_src emacs-lisp
    (defun my/run-home-manager-switch ()
    "sudo nixos-rebuild switch --flake ~/nixos-config#tuffy"
    (interactive)
    (async-shell-command "home-manager switch")
    (sleep-for 2))

    (my/leader-keys
    "n"   '(:ignore t :which-key "nix")
    "nh"  '(:prefix t :which-key "home manager")
    "nhs" '(my/run-home-manager-switch :which-key "switch")
    "nhe" '( (lambda()(interactive)(find-file-existing "~/nixos-config/home/me/default.nix")) :which-key "edit")
    "nht" '( (lambda()(interactive)(find-file-existing "~/nixos-config/hosts/tuffy/default.nix")) :which-key "tuffy")

    )
#+end_src

